Sure @barryib!

> `Did you change your worker groups order in var.workers_launch_templates ?`:

**Answer**: No, I didn't.

>`Or Removed something in that list ?`:

**Answer**: Yes, I changed the key_name on `worker_groups_launch_template` and update the ingress on one of SG `additional_security_group_ids`.


**Terraform Plan**:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_security_group.admin_ssh will be updated in-place
  ~ resource "aws_security_group" "admin_ssh" {
        arn                    = "arn:aws:ec2:XXXXXXXXX:...."
        description            = "nodes that can be connected to via ssh by administrators"
        egress                 = []
        id                     = "sg-ddddddd"
      ~ ingress                = [
            {
                cidr_blocks      = [
                    "x.x.x.x/32",
                ]
                description      = "Ingress1 "
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "104.33.212.83/32",
                ]
                description      = "Ingress2"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/32",
                ]
                description      = "Ingress3"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/32",
                ]
                description      = "Ingress4"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/13",
                ]
                description      = "Ingress5"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/32",
                ]
                description      = "Ingress5"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/14",
                ]
                description      = "Ingress6"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/32",
                ]
                description      = "Ingress7"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "x.x.x.x/32",
                ]
              - description      = "Ingress8"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "x.x.x.x/32",
                ]
              + description      = "Ingress9"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/13",
                ]
                description      = "Ingress10"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
            {
                cidr_blocks      = [
                    "x.x.x.x/12",
                ]
                description      = "Ingress11"
                from_port        = 22
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
        ]
        name                   = "terraform-20xxxxxx"
        owner_id               = "xxxxxxxxxxxxxxxxx"
        revoke_rules_on_delete = false
        tags                   = {}
        vpc_id                 = "vpc-xxxxxxxxxxx"
    }

  # module.eks_cluster.aws_autoscaling_group.workers_launch_template[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers_launch_template" {
        arn                       = "arn:aws:autoscaling:us-west-2:xxxxxxxxxxxxxxxxxxxx"
        availability_zones        = [
            "us-west-2a",
            "us-west-2b",
        ]
        default_cooldown          = 300
        desired_capacity          = 3
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "EC2"
        id                        = "dev-uxxxxxxxxxx"
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 3
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "dev-uxxxxxxxx"
        name_prefix               = "dev-usw2-spot01"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::xxxxxxxxxxxxxxxx:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = [
            "AZRebalance",
        ]
      ~ tags                      = [
          - {
              - "key"                 = "Name"
              - "propagate_at_launch" = "true"
              - "value"               = "dev-usw2-spot01-eks_asg"
            },
          - {
              - "key"                 = "kubernetes.io/cluster/xxxxxxxxxx"
              - "propagate_at_launch" = "true"
              - "value"               = "owned"
            },
        ]
        target_group_arns         = []
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-xxxxxxxxx",
            "subnet-xxxxxxxxxx",
        ]
        wait_for_capacity_timeout = "10m"

        mixed_instances_policy {
            instances_distribution {
                on_demand_allocation_strategy            = "prioritized"
                on_demand_base_capacity                  = 0
                on_demand_percentage_above_base_capacity = 0
                spot_allocation_strategy                 = "lowest-price"
                spot_instance_pools                      = 2
            }

            launch_template {
                launch_template_specification {
                    launch_template_id   = "lt-0d1xxxxx55dfb92cxxxxxxxxxx"
                    launch_template_name = "dev-uxxxxxxxxxxxxxx"
                    version              = "$Latest"
                }

                override {
                    instance_type = "m5dn.xlarge"
                }
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "dev-usw2-spot01-eks_asg"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/xxxxxxxxxxxx"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks_cluster.aws_autoscaling_group.workers_launch_template[1] will be destroyed
  - resource "aws_autoscaling_group" "workers_launch_template" {
      - arn                       = "arn:aws:autoscaling:us-west-2:xxxxxxxxxxxxxxxx:autoScalingGroup:xxxxxxxxxxxxxxxxx:autoScalingGroupName/dev-uxxxxxxxxxxx" -> null
      - availability_zones        = [
          - "us-west-2a",
          - "us-west-2b",
        ] -> null
      - default_cooldown          = 300 -> null
      - desired_capacity          = 3 -> null
      - enabled_metrics           = [] -> null
      - force_delete              = false -> null
      - health_check_grace_period = 300 -> null
      - health_check_type         = "EC2" -> null
      - id                        = "dev-usw2-mxxxxxxxxxx" -> null
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      - max_size                  = 3 -> null
      - metrics_granularity       = "1Minute" -> null
      - min_size                  = 1 -> null
      - name                      = "dev-usw2-mxxxxxxxxxxxxxxx" -> null
      - name_prefix               = "dev-usw2-main01" -> null
      - protect_from_scale_in     = false -> null
      - service_linked_role_arn   = "arn:aws:iam::xxxxxxxxxxxxxxxx:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes       = [] -> null
      - tags                      = [
          - {
              - "key"                 = "Name"
              - "propagate_at_launch" = "true"
              - "value"               = "dev-usw2-main01-eks_asg"
            },
          - {
              - "key"                 = "kubernetes.io/cluster/xxxxxxxxxx"
              - "propagate_at_launch" = "true"
              - "value"               = "owned"
            },
        ] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      - vpc_zone_identifier       = [
          - "subnet-xxxxxxxxxxxxxx",
          - "subnet-zxxxxxxxxxxxxxxxxx",
        ] -> null
      - wait_for_capacity_timeout = "10m" -> null

      - launch_template {
          - id      = "lt-xxxxxxx" -> null
          - name    = "dev-usw2-mxxxxxxxxxxxx" -> null
          - version = "$Latest" -> null
        }
    }

  # module.eks_cluster.aws_iam_instance_profile.workers_launch_template[1] will be destroyed
  - resource "aws_iam_instance_profile" "workers_launch_template" {
      - arn         = "arn:aws:iam::xxxxxxxxxxx:instance-profile/dev-uxxxxxxxxxx" -> null
      - create_date = "2020-07-16T21:34:08Z" -> null
      - id          = "dev-uxxxxxxxxxxx" -> null
      - name        = "dev-uxxxxxxxxxxxxxxxxxxxx" -> null
      - name_prefix = "dev-usw2" -> null
      - path        = "/" -> null
      - role        = "dev-uxxxxxxxxxxxxxxxxxxxxx" -> null
      - unique_id   = "AIPXXXXXXXXXXXXXX" -> null
    }

  # module.eks_cluster.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "dev-uxxxxxxxxx-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::xxxxxxx"
      + role       = "dev-uxxxxxxxxxxxxxxxxxxxx"
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-uxxxxxxxxxxxxxxxx"
    }

  # module.eks_cluster.aws_launch_template.workers_launch_template[0] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        arn                     = "arn:aws:ec2:us-west-2:xxxxxxxxxxx:launch-template/lt-xxxxxxxxxxxxxxxxxx"
        default_version         = 1
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-xxxxxxxxxxxxx"
      ~ image_id                = "ami-0e7c64dcd14089a77" -> "ami-0865553b27df49930"
        instance_type           = "m4.large"
        key_name                = "KeyName"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "dev-uxxxxxxxx-sxxxxxxxxxxxxxx"
        name_prefix             = "dev-uxxxxxxx-spot01"
        security_group_names    = []
        tags                    = {}
        user_data               = "XXXXXmluL2Jhc2ggLxxxxxxxxxxxxxxxx"
        vpc_security_group_ids  = []

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "false"
              + iops                  = 0
              + volume_size           = 30
              + volume_type           = "gp2"
            }
        }

        credit_specification {
            cpu_credits = "standard"
        }

        iam_instance_profile {
            name = "dev-usxxxxxxxxxxxxx"
        }

      + metadata_options {
          + http_endpoint = "enabled"
          + http_tokens   = "optional"
        }

        monitoring {
            enabled = true
        }

        network_interfaces {
            associate_public_ip_address = "true"
            delete_on_termination       = "true"
            device_index                = 0
            ipv4_address_count          = 0
            ipv4_addresses              = []
            ipv6_address_count          = 0
            ipv6_addresses              = []
            security_groups             = [
                "sg-01b4be739xxxxxxxxxx",
                "sg-05aexxxxx",
                "sg-xxxxef2a59xxxxxxxxxx",
            ]
        }

        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Name" = "dev-usxx"
            }
        }
        tag_specifications {
            resource_type = "instance"
            tags          = {
                "Name" = "dev-usxxxx"
            }
        }
    }

  # module.eks_cluster.aws_launch_template.workers_launch_template[1] will be destroyed
  - resource "aws_launch_template" "workers_launch_template" {
      - arn                     = "arn:aws:ec2:us-west-2:xxxxxxxxxxxxx:launch-template/lt-xxxxxxxxxxxxxxxxx" -> null
      - default_version         = 1 -> null
      - disable_api_termination = false -> null
      - ebs_optimized           = "true" -> null
      - id                      = "lt-0dexxxxxxxx" -> null
      - image_id                = "ami-010e52511bbeb82e7" -> null
      - instance_type           = "m5dn.xlarge" -> null
      - key_name                = "oldKeyName" -> null
      - latest_version          = 1 -> null
      - name                    = "dev-usxxxxxxxxxxxxxx" -> null
      - name_prefix             = "dev-usssssssssaa-main01" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - user_data               = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgxxxxxxxxxx" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - iam_instance_profile {
          - name = "dev-usxxxxxxxxxx" -> null
        }

      - monitoring {
          - enabled = true -> null
        }

      - network_interfaces {
          - associate_public_ip_address = "true" -> null
          - delete_on_termination       = "true" -> null
          - device_index                = 0 -> null
          - ipv4_address_count          = 0 -> null
          - ipv4_addresses              = [] -> null
          - ipv6_address_count          = 0 -> null
          - ipv6_addresses              = [] -> null
          - security_groups             = [
              - "sg-01b4be73xxxxx",
              - "sg-xx0ab294axxx",
              - "sg-09xxxxxxxxxxxxx",
            ] -> null
        }

      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Name" = "dev-ussssssssss-main01-eks_asg"
            } -> null
        }
      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name" = "dev-usasassssa-main01-eks_asg"
            } -> null
        }
    }

  # module.eks_cluster.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
        binary_data = {}
        data        = {
            "mapAccounts" = jsonencode([])
            "mapRoles"    = <<~EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::xxxxxxxxx:role/dev-uxxxxxxxxx"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::xxxxxxxxxxx:role/role_name"
                  "username": "dev-cxxxxxxxxxxxx"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::xxxxxxxxxxxx:role/role_name"
                  "username": "dev-cxxxxxxxxxxxxx"
            EOT
            "mapUsers"    = jsonencode([])
        }
        id          = "kube-system/aws-auth"

      ~ metadata {
            annotations      = {}
            generation       = 0
          ~ labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
            name             = "aws-auth"
            namespace        = "kube-system"
            resource_version = "5271277"
            self_link        = "/api/v1/namespaces/kube-system/configmaps/aws-auth"
            uid              = "819b7bxxxxxxxxx-xxxxxxx"
        }
    }

  # module.eks_cluster.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<~EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://xxxxxxxxxxxxx.xxxxx7.xxxxxxxxxxxxxxx.eks.amazonaws.com
                certificate-authority-data: LSxxxxxXXXXXXXXXXXXXXXXXXXXX
              name: xxxxxxxxxxxxxxx
            
            contexts:
            - context:
                cluster: xxxxxxxxx
                user: xxxxxxxxx
              name: xxxxxxxxxxx
            
            current-context: xxxxxxxxxx
            
            users:
            - name: xxxxxxxxxxxxxxxxxxx
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "xxxxxxxxxxxxxxx"
                  env:
                    - name: AWS_PROFILE
                      value: zxXZXXXXXXXXXXXX
            
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_xxxxxxxxxxx"
      + id                   = (known after apply)
    }

  # module.eks_cluster.random_pet.workers_launch_template[0] must be replaced
+/- resource "random_pet" "workers_launch_template" {
      ~ id        = "closing-shad" -> (known after apply)
      ~ keepers   = {
          - "lt_name" = "dev-uxxxxxxxxxx"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

  # module.eks_cluster.random_pet.workers_launch_template[1] will be destroyed
  - resource "random_pet" "workers_launch_template" {
      - id        = "united-cicada" -> null
      - keepers   = {
          - "lt_name" = "dev-uxxxxxxxxxxxxxxx"
        } -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

.........

Plan: 5 to add, 4 to change, 6 to destroy.

```

Thanks!